mathews0x0/datalogger-v2/firmware/sdkconfig.defaults.esp32s3
# ============================================================
# RaceSense ESP32-S3 Default SDK Configuration
# Target: RaceSense RS-Core V4.2 PCB (ESP32-S3-WROOM-1-N16R8)
# ============================================================

CONFIG_IDF_TARGET="esp32s3"

# --- Flash (16MB Flash) ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM (8MB Octal PSRAM) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- Native Wi-Fi ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=y
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7

# --- LVGL Display ---
CONFIG_LV_COLOR_16_SWAP=y
